locale = {
    "start_text": {
        "ru": """Добро пожаловать в магазин-бот продажи аккаунтов Google Mail, Google Voice с выбором под штат и сервис по приему смс на номера T-Mobile. Обязательно прочитайте "FAQ" перед использованием сервиса! К оплате принимается BTC, LTC, Perfect Money,QIWI.""",
        "en": """Добро пожаловать в магазин-бот продажи аккаунтов Google Mail, Google Voice с выбором под штат и сервис по приему смс на номера T-Mobile. Обязательно прочитайте "FAQ" перед использованием сервиса! К оплате принимается BTC, LTC, Perfect Money,QIWI.""",
    },
    "locale_text": {"ru": """Выберите язык""", "en": """Выберите язык"""},
    "catalog": {
        "ru": """Каталог
➖➖➖➖➖➖➖➖➖➖""",
        "en": """Catalog
➖➖➖➖➖➖➖➖➖➖""",
    },
    "sms_mobile_operator": {
        "ru": """Выберите мобильного оператора""",
        "en": """Choose operator.""",
    },
    "sms_main": {"ru": """Выберите сервис""", "en": """Choose service."""},
    "order_sms": {
        "ru": '''Ваш номер телефона: <i>+1{number}</i>\nКак только смс будет отправлено, нажмите кнопку "Проверить смс"''',
        "en": '''Ваш номер телефона: <i>+1{number}</i>\nКак только смс будет отправлено, нажмите кнопку "Проверить смс"''',
    },
    "order_accepted": {
        "ru": '''Ваш номер телефона: <i>+1{number}</i>\nКод из СМС: <i>{code}</i>\nЕсли код не был получен, нажмите "Получить полное сообщение"''',
        "en": '''Ваш номер телефона: <i>+1{number}</i>\nКод из СМС: <i>{code}</i>\nЕсли код не был получен, нажмите "Получить полное сообщение"''',
    },
    "out_of_stoke": {
        "ru": """В данный момент товара нет в наличии""",
        "en": """The product temporarily out of stoke.""",
    },
    "count_of_product": {
        "ru": """Кол-во товара {name}: {count} шт.

Минимальное кол-во к покупке: 1
➖➖➖➖➖➖➖➖➖➖
Введите необходимое Вам кол-во.""",
        "en": """Quantity {name}: {count} pc(s).

Minimum purchase quantity: 1
➖➖➖➖➖➖➖➖➖➖
Please enter the quantity.""",
    },
    "int_pls": {
        "ru": """Некорректное число!
Число должно быть целым и положительным.""",
        "en": """Invalid number!
The number must be whole and positive.""",
    },
    "order_text": {
        "ru": """Подробности заказа
➖➖➖➖➖➖➖➖➖➖
Название товара: {name}
Кол-во товаров: {count}
Сумма к оплате: {total} $

Вы собираетесь приобрести данный товар?""",
        "en": """Order details
➖➖➖➖➖➖➖➖➖➖
Item name: {name}
Quantity: {count}
Total: {total} $

Are you going to buy this product?""",
    },
    "buy_accept": {"ru": """Покупка оформлена""", "en": """Purchase made"""},
    "no_money": {
        "ru": """На вашем счету недостаточно средств для оплаты товара!""",
        "en": """There are not enough funds on your account to pay for the goods!""",
    },
    "faq": {
        "ru": """1. Для покупки товаров Вам необходимо пополнить внутренний баланс. Это можно сделать нажав [Мой Профиль] --> [Пополнить баланс].
2. После оплаты через Qiwi и Perfect Money пополнение баланса происходит мгновенно. После оплаты в LTC пополнение баланса происходит автоматически после 6 подтверждений сети. После оплаты через BTC пополнение баланса происходит автоматически после 2 подтверждений сети.
3. При оплате в Perfect Money не забудьте указать в комментариях номер транзакции указанной в боте:
"⚠️ Пополнение PerfectMoney
Переведите средства на счет U31442349 сумму в 5$ указав в комментариях номер который укажет вам бот"
4. Используйте только USA IP для аккаунтов.
5. Используйте разные профили браузеров для разных аккаунтов.
6. Не используйте gmail, gvoice как личный и для важной работы. Есть риск блокировки.
7. 5 дней от покупки гарантия на блокирование аккаунта, не возможность войти и тд.
8. Некоторые аккаунты могут запрашивать принять смс при входе. Для этого нужно принять смс на любой номер(реальный или виртуальный) любой страны. Это разово. Такие аккаунты не являются поводом для замены.
9. После покупки аккаунта Gmail или GVoice ВЫ ОБЯЗАНЫ СМЕНИТЬ ПАРОЛЬ И ПОЧТУ ДЛЯ ВОССТАНОВЛЕНИЯ АККАУНТА.
""",
        "en": """1. To buy a product you need to top up your account balance. You can do this by clicking [My Profile] -> [Add balance].
2. After payment via Qiwi and Perfect Money, the balance is replenished instantly. After paying in LTC, the balance is replenished automatically after 6 network confirmations. After paying with BTC, the balance is replenished automatically after 2 network confirmations.
3. You need to use only US IP-addresses for the accounts.
4. Each account must be used under different browser profile.
5. Do not use these gmail as personal or for important work. There is always a risk of getting it banned.
6. We have a 5 day replace policy in case of a ban, logging in issues etc.
7. Some accounts may ask you to accept an SMS when you log in. To do this, you need to receive an SMS to any number(real or virtual) of any country. This is a one-time event. Such accounts are not a reason for replacement.
8. After purchasing a Gmail or GVoice account, YOU MUST CHANGE YOUR PASSWORD AND EMAIL ADDRESS TO RESTORE YOUR ACCOUNT.
9. When paying for Perfect Money, do not forget to indicate in the comments of the transaction number specified in the bot.
""",
    },
    "question": {
        "ru": """По всем вопросам пожалуйста обращайтесь к @robinzoncruzzo""",
        "en": """For all inquiries please contact @robinzoncruzzo""",
    },
    "my_cabinet": {
        "ru": """
💰 Баланс: {balance} $
🛒 Покупок: {sold_count}
""",
        "en": """
💰 Balance: {balance} $
🛒 Purchased: {sold_count}
""",
    },
    "deposit_await_sum": {
        "ru": """⚠️ Введите сумму пополнения
Минимальная сумма депозита - 5$""",
        "en": """⚠️ Enter the amount of deposit
The minimum deposit amount is $5""",
    },
    "invalid_sum": {
        "ru": """⚠️ Минимальная сумма 3$""",
        "en": """⚠️ Minimum deposit amount 3$""",
    },
    "await_trans": {
        "ru": """⚠️ Пополнение криптовалютой
Средства поступают после 1 подтверждений сети""",
        "en": """⚠️ Cryptocurrency replenishment
Funds are received after 1 confirmations of the network""",
    },
    "await_btcpay_trans": {
        "ru": """⚠️ Пополнение криптовалютой
Средства поступают после 1 подтверждений сети""",
        "en": """⚠️ Cryptocurrency replenishment
Funds are received after 1 confirmations of the network""",
    },
    "await_qiwi_trans": {
        "ru": '''⚠️ Пополнение Qiwi
Переведите средства по ссылке, после чего нажмите на кнопку "Проверить"''',
        "en": '''⚠️ Пополнение Qiwi
Переведите средства по ссылке, после чего нажмите на кнопку "Проверить"''',
    },
    "await_perfect_money_trans": {
        "ru": """⚠️ Пополнение PerfectMoney
Переведите средства на счет {} сумму в {}$ указав в комментариях {}""",
        "en": """⚠️ PerfectMoney replenishment
Translate funds to the account {} {}$ specifying in the comments {}""",
    },
    "await_paykassa_trans": {
        "ru": """⚠️ Пополнение PayKassa""",
        "en": """⚠️ PerfectMoney PayKassa""",
    },
    "payment_system": {
        "ru": """Выберите платежную систему""",
        "en": """Choose payment system""",
    },
    "payment_complete": {
        "ru": """Баланс был пополнен""",
        "en": """Balance replenished""",
    },
    "not_transaction": {
        "ru": """Ваша транзакция еще не окончена""",
        "en": """Your transaction has not been completed yet""",
    },
    "not_aviable_method": {
        "ru": """Этот метод оплаты пока не доступен""",
        "en": """This payment method is not aviable""",
    },
}
